Ran Plan for dir: `devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5` workspace: `devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5`

<details><summary>Show Output</summary>

```diff
11:54:53.987 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.10.5` instead.
11:55:25.985 STDOUT terraform1.10.5: Terraform used the selected providers to generate the following execution
11:55:25.986 STDOUT terraform1.10.5: plan. Resource actions are indicated with the following symbols:
11:55:25.986 STDOUT terraform1.10.5:   + create
11:55:25.986 STDOUT terraform1.10.5: Terraform will perform the following actions:
11:55:25.986 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_autoscaling_group.idc[0] will be created
11:55:25.986 STDOUT terraform1.10.5:   + resource "aws_autoscaling_group" "idc" {
11:55:25.986 STDOUT terraform1.10.5:       + arn                              = (known after apply)
11:55:25.986 STDOUT terraform1.10.5:       + availability_zones               = (known after apply)
11:55:25.986 STDOUT terraform1.10.5:       + default_cooldown                 = (known after apply)
11:55:25.986 STDOUT terraform1.10.5:       + desired_capacity                 = (known after apply)
11:55:25.987 STDOUT terraform1.10.5:       + force_delete                     = false
11:55:25.987 STDOUT terraform1.10.5:       + force_delete_warm_pool           = false
11:55:25.987 STDOUT terraform1.10.5:       + health_check_grace_period        = 300
11:55:25.987 STDOUT terraform1.10.5:       + health_check_type                = "EC2"
11:55:25.987 STDOUT terraform1.10.5:       + id                               = (known after apply)
11:55:25.987 STDOUT terraform1.10.5:       + ignore_failed_scaling_activities = false
11:55:25.987 STDOUT terraform1.10.5:       + load_balancers                   = (known after apply)
11:55:25.987 STDOUT terraform1.10.5:       + max_size                         = 2
11:55:25.987 STDOUT terraform1.10.5:       + metrics_granularity              = "1Minute"
11:55:25.987 STDOUT terraform1.10.5:       + min_size                         = 1
11:55:25.987 STDOUT terraform1.10.5:       + name                             = "t1-skeleton-eu-central-1-mycluster5-on-demand"
11:55:25.987 STDOUT terraform1.10.5:       + name_prefix                      = (known after apply)
11:55:25.987 STDOUT terraform1.10.5:       + predicted_capacity               = (known after apply)
11:55:25.988 STDOUT terraform1.10.5:       + protect_from_scale_in            = true
11:55:25.988 STDOUT terraform1.10.5:       + service_linked_role_arn          = (known after apply)
11:55:25.988 STDOUT terraform1.10.5:       + target_group_arns                = (known after apply)
11:55:25.988 STDOUT terraform1.10.5:       + termination_policies             = [
11:55:25.988 STDOUT terraform1.10.5:           + "ClosestToNextInstanceHour",
11:55:25.988 STDOUT terraform1.10.5:         ]
11:55:25.988 STDOUT terraform1.10.5:       + vpc_zone_identifier              = [
11:55:25.988 STDOUT terraform1.10.5:           + "subnet-037463b536cb5f104",
11:55:25.988 STDOUT terraform1.10.5:           + "subnet-0abc2655bb6d38578",
11:55:25.988 STDOUT terraform1.10.5:           + "subnet-0defa5251b0f81792",
11:55:25.989 STDOUT terraform1.10.5:         ]
11:55:25.989 STDOUT terraform1.10.5:       + wait_for_capacity_timeout        = "10m"
11:55:25.989 STDOUT terraform1.10.5:       + warm_pool_size                   = (known after apply)
11:55:25.989 STDOUT terraform1.10.5:       + availability_zone_distribution (known after apply)
11:55:25.989 STDOUT terraform1.10.5:       + launch_template {
11:55:25.989 STDOUT terraform1.10.5:           + id      = (known after apply)
11:55:25.989 STDOUT terraform1.10.5:           + name    = (known after apply)
11:55:25.989 STDOUT terraform1.10.5:           + version = "$Latest"
11:55:25.989 STDOUT terraform1.10.5:         }
11:55:25.989 STDOUT terraform1.10.5:       + mixed_instances_policy (known after apply)
11:55:25.990 STDOUT terraform1.10.5:       + tag {
11:55:25.990 STDOUT terraform1.10.5:           + key                 = "AmazonECSManaged"
11:55:25.990 STDOUT terraform1.10.5:           + propagate_at_launch = true
11:55:25.990 STDOUT terraform1.10.5:           + value               = "true"
11:55:25.990 STDOUT terraform1.10.5:         }
11:55:25.990 STDOUT terraform1.10.5:       + tag {
11:55:25.990 STDOUT terraform1.10.5:           + key                 = "Environment"
11:55:25.990 STDOUT terraform1.10.5:           + propagate_at_launch = true
11:55:25.990 STDOUT terraform1.10.5:           + value               = "t1"
11:55:25.990 STDOUT terraform1.10.5:         }
11:55:25.991 STDOUT terraform1.10.5:       + tag {
11:55:25.991 STDOUT terraform1.10.5:           + key                 = "Name"
11:55:25.991 STDOUT terraform1.10.5:           + propagate_at_launch = true
11:55:25.991 STDOUT terraform1.10.5:           + value               = "t1-skeleton-eu-central-1-mycluster5-on-demand"
11:55:25.991 STDOUT terraform1.10.5:         }
11:55:25.991 STDOUT terraform1.10.5:       + tag {
11:55:25.991 STDOUT terraform1.10.5:           + key                 = "Namespace"
11:55:25.991 STDOUT terraform1.10.5:           + propagate_at_launch = true
11:55:25.991 STDOUT terraform1.10.5:           + value               = "skeleton"
11:55:25.991 STDOUT terraform1.10.5:         }
11:55:25.991 STDOUT terraform1.10.5:       + tag {
11:55:25.992 STDOUT terraform1.10.5:           + key                 = "Region"
11:55:25.992 STDOUT terraform1.10.5:           + propagate_at_launch = true
11:55:25.992 STDOUT terraform1.10.5:           + value               = "eu-central-1"
11:55:25.992 STDOUT terraform1.10.5:         }
11:55:25.992 STDOUT terraform1.10.5:       + timeouts {}
11:55:25.992 STDOUT terraform1.10.5:       + traffic_source (known after apply)
11:55:25.992 STDOUT terraform1.10.5:     }
11:55:25.992 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_instance_profile.this[0] will be created
11:55:25.992 STDOUT terraform1.10.5:   + resource "aws_iam_instance_profile" "this" {
11:55:25.992 STDOUT terraform1.10.5:       + arn         = (known after apply)
11:55:25.993 STDOUT terraform1.10.5:       + create_date = (known after apply)
11:55:25.993 STDOUT terraform1.10.5:       + id          = (known after apply)
11:55:25.993 STDOUT terraform1.10.5:       + name        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
11:55:25.993 STDOUT terraform1.10.5:       + name_prefix = (known after apply)
11:55:25.993 STDOUT terraform1.10.5:       + path        = "/"
11:55:25.993 STDOUT terraform1.10.5:       + role        = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
11:55:25.993 STDOUT terraform1.10.5:       + tags        = {
11:55:25.993 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:25.993 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:25.993 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:25.994 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:25.994 STDOUT terraform1.10.5:         }
11:55:25.994 STDOUT terraform1.10.5:       + tags_all    = {
11:55:25.994 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:25.994 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:25.994 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:25.994 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:25.994 STDOUT terraform1.10.5:         }
11:55:25.994 STDOUT terraform1.10.5:       + unique_id   = (known after apply)
11:55:25.994 STDOUT terraform1.10.5:     }
11:55:25.994 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role.this[0] will be created
11:55:25.995 STDOUT terraform1.10.5:   + resource "aws_iam_role" "this" {
11:55:25.995 STDOUT terraform1.10.5:       + arn                   = (known after apply)
11:55:25.995 STDOUT terraform1.10.5:       + assume_role_policy    = jsonencode(
11:55:25.995 STDOUT terraform1.10.5:             {
11:55:25.995 STDOUT terraform1.10.5:               + Statement = [
11:55:25.995 STDOUT terraform1.10.5:                   + {
11:55:25.995 STDOUT terraform1.10.5:                       + Action    = "sts:AssumeRole"
11:55:25.995 STDOUT terraform1.10.5:                       + Effect    = "Allow"
11:55:25.996 STDOUT terraform1.10.5:                       + Principal = {
11:55:25.996 STDOUT terraform1.10.5:                           + Service = "ec2.amazonaws.com"
11:55:25.996 STDOUT terraform1.10.5:                         }
11:55:25.996 STDOUT terraform1.10.5:                       + Sid       = "EC2AssumeRole"
11:55:25.996 STDOUT terraform1.10.5:                     },
11:55:25.996 STDOUT terraform1.10.5:                 ]
11:55:25.996 STDOUT terraform1.10.5:               + Version   = "2012-10-17"
11:55:25.996 STDOUT terraform1.10.5:             }
11:55:25.996 STDOUT terraform1.10.5:         )
11:55:25.996 STDOUT terraform1.10.5:       + create_date           = (known after apply)
11:55:25.997 STDOUT terraform1.10.5:       + description           = "ECS role for t1-skeleton-eu-central-1-mycluster5"
11:55:25.997 STDOUT terraform1.10.5:       + force_detach_policies = true
11:55:25.997 STDOUT terraform1.10.5:       + id                    = (known after apply)
11:55:25.997 STDOUT terraform1.10.5:       + managed_policy_arns   = (known after apply)
11:55:25.997 STDOUT terraform1.10.5:       + max_session_duration  = 3600
11:55:25.997 STDOUT terraform1.10.5:       + name                  = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
11:55:25.997 STDOUT terraform1.10.5:       + name_prefix           = (known after apply)
11:55:25.998 STDOUT terraform1.10.5:       + path                  = "/"
11:55:25.998 STDOUT terraform1.10.5:       + tags                  = {
11:55:25.998 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:25.998 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:25.998 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:25.998 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:25.998 STDOUT terraform1.10.5:         }
11:55:25.998 STDOUT terraform1.10.5:       + tags_all              = {
11:55:25.999 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:25.999 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:25.999 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:25.999 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:25.999 STDOUT terraform1.10.5:         }
11:55:25.999 STDOUT terraform1.10.5:       + unique_id             = (known after apply)
11:55:25.999 STDOUT terraform1.10.5:       + inline_policy (known after apply)
11:55:25.999 STDOUT terraform1.10.5:     }
11:55:25.999 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerServiceforEC2Role"] will be created
11:55:26.000 STDOUT terraform1.10.5:   + resource "aws_iam_role_policy_attachment" "this" {
11:55:26.000 STDOUT terraform1.10.5:       + id         = (known after apply)
11:55:26.000 STDOUT terraform1.10.5:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
11:55:26.000 STDOUT terraform1.10.5:       + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
11:55:26.000 STDOUT terraform1.10.5:     }
11:55:26.000 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
11:55:26.000 STDOUT terraform1.10.5:   + resource "aws_iam_role_policy_attachment" "this" {
11:55:26.000 STDOUT terraform1.10.5:       + id         = (known after apply)
11:55:26.001 STDOUT terraform1.10.5:       + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
11:55:26.001 STDOUT terraform1.10.5:       + role       = "t1-skeleton-eu-central-1-mycluster5-on-demand-role"
11:55:26.001 STDOUT terraform1.10.5:     }
11:55:26.001 STDOUT terraform1.10.5:   # module.autoscaling["on-demand"].aws_launch_template.this[0] will be created
11:55:26.001 STDOUT terraform1.10.5:   + resource "aws_launch_template" "this" {
11:55:26.001 STDOUT terraform1.10.5:       + arn                    = (known after apply)
11:55:26.001 STDOUT terraform1.10.5:       + default_version        = (known after apply)
11:55:26.001 STDOUT terraform1.10.5:       + description            = "Launch template t1-skeleton-eu-central-1-mycluster5"
11:55:26.001 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:55:26.002 STDOUT terraform1.10.5:       + image_id               = (sensitive value)
11:55:26.002 STDOUT terraform1.10.5:       + instance_type          = "t3.medium"
11:55:26.002 STDOUT terraform1.10.5:       + latest_version         = (known after apply)
11:55:26.002 STDOUT terraform1.10.5:       + name                   = "t1-skeleton-eu-central-1-mycluster5-on-demand-lt"
11:55:26.002 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
11:55:26.002 STDOUT terraform1.10.5:       + tags                   = {
11:55:26.002 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.002 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.002 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.003 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.004 STDOUT terraform1.10.5:         }
11:55:26.004 STDOUT terraform1.10.5:       + tags_all               = {
11:55:26.004 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.004 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.004 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.004 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.004 STDOUT terraform1.10.5:         }
11:55:26.004 STDOUT terraform1.10.5:       + update_default_version = true
11:55:26.004 STDOUT terraform1.10.5:       + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9dDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUKRUNTX0xPR0xFVkVMPWRlYnVnCkVDU19DT05UQUlORVJfSU5TVEFOQ0VfVEFHUz17IkVudmlyb25tZW50IjoidDEiLCJOYW1lIjoidDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUiLCJOYW1lc3BhY2UiOiJza2VsZXRvbiIsIlJlZ2lvbiI6ImV1LWNlbnRyYWwtMSJ9CkVDU19FTkFCTEVfVEFTS19JQU1fUk9MRT10cnVlCkVPRgoK"
11:55:26.005 STDOUT terraform1.10.5:       + vpc_security_group_ids = (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + iam_instance_profile (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + metadata_options (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + monitoring {
11:55:26.005 STDOUT terraform1.10.5:           + enabled = true
11:55:26.005 STDOUT terraform1.10.5:         }
11:55:26.005 STDOUT terraform1.10.5:     }
11:55:26.005 STDOUT terraform1.10.5:   # module.autoscaling_sg.aws_security_group.this[0] will be created
11:55:26.005 STDOUT terraform1.10.5:   + resource "aws_security_group" "this" {
11:55:26.005 STDOUT terraform1.10.5:       + arn                    = (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + description            = "Autoscaling group security group for t1-skeleton-eu-central-1-mycluster5"
11:55:26.005 STDOUT terraform1.10.5:       + egress                 = (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + ingress                = (known after apply)
11:55:26.005 STDOUT terraform1.10.5:       + name                   = "t1-skeleton-eu-central-1-mycluster5-asg-sg"
11:55:26.006 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
11:55:26.006 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
11:55:26.006 STDOUT terraform1.10.5:       + revoke_rules_on_delete = false
11:55:26.006 STDOUT terraform1.10.5:       + tags                   = {
11:55:26.006 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.006 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.006 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.006 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.006 STDOUT terraform1.10.5:         }
11:55:26.006 STDOUT terraform1.10.5:       + tags_all               = {
11:55:26.006 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.006 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.006 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.007 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.007 STDOUT terraform1.10.5:         }
11:55:26.007 STDOUT terraform1.10.5:       + vpc_id                 = "vpc-0e28c2e97a89fca9e"
11:55:26.007 STDOUT terraform1.10.5:       + timeouts {
11:55:26.007 STDOUT terraform1.10.5:           + create = "10m"
11:55:26.007 STDOUT terraform1.10.5:           + delete = "15m"
11:55:26.007 STDOUT terraform1.10.5:         }
11:55:26.007 STDOUT terraform1.10.5:     }
11:55:26.007 STDOUT terraform1.10.5:   # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
11:55:26.007 STDOUT terraform1.10.5:   + resource "aws_security_group_rule" "egress_rules" {
11:55:26.007 STDOUT terraform1.10.5:       + cidr_blocks              = [
11:55:26.007 STDOUT terraform1.10.5:           + "0.0.0.0/0",
11:55:26.007 STDOUT terraform1.10.5:         ]
11:55:26.007 STDOUT terraform1.10.5:       + description              = "All protocols"
11:55:26.007 STDOUT terraform1.10.5:       + from_port                = -1
11:55:26.007 STDOUT terraform1.10.5:       + id                       = (known after apply)
11:55:26.007 STDOUT terraform1.10.5:       + ipv6_cidr_blocks         = [
11:55:26.007 STDOUT terraform1.10.5:           + "::/0",
11:55:26.007 STDOUT terraform1.10.5:         ]
11:55:26.007 STDOUT terraform1.10.5:       + prefix_list_ids          = []
11:55:26.007 STDOUT terraform1.10.5:       + protocol                 = "-1"
11:55:26.007 STDOUT terraform1.10.5:       + security_group_id        = (known after apply)
11:55:26.007 STDOUT terraform1.10.5:       + security_group_rule_id   = (known after apply)
11:55:26.007 STDOUT terraform1.10.5:       + self                     = false
11:55:26.007 STDOUT terraform1.10.5:       + source_security_group_id = (known after apply)
11:55:26.007 STDOUT terraform1.10.5:       + to_port                  = -1
11:55:26.007 STDOUT terraform1.10.5:       + type                     = "egress"
11:55:26.007 STDOUT terraform1.10.5:     }
11:55:26.007 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
11:55:26.072 STDOUT terraform1.10.5:   + resource "aws_cloudwatch_log_group" "this" {
11:55:26.072 STDOUT terraform1.10.5:       + arn               = (known after apply)
11:55:26.072 STDOUT terraform1.10.5:       + id                = (known after apply)
11:55:26.072 STDOUT terraform1.10.5:       + log_group_class   = (known after apply)
11:55:26.072 STDOUT terraform1.10.5:       + name              = "/aws/ecs/t1-skeleton-eu-central-1-mycluster5"
11:55:26.072 STDOUT terraform1.10.5:       + name_prefix       = (known after apply)
11:55:26.072 STDOUT terraform1.10.5:       + retention_in_days = 90
11:55:26.072 STDOUT terraform1.10.5:       + skip_destroy      = false
11:55:26.072 STDOUT terraform1.10.5:       + tags              = {
11:55:26.072 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.072 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.072 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.073 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.073 STDOUT terraform1.10.5:         }
11:55:26.073 STDOUT terraform1.10.5:       + tags_all          = {
11:55:26.073 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.073 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.073 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.073 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.073 STDOUT terraform1.10.5:         }
11:55:26.073 STDOUT terraform1.10.5:     }
11:55:26.073 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_capacity_provider.this["on-demand"] will be created
11:55:26.073 STDOUT terraform1.10.5:   + resource "aws_ecs_capacity_provider" "this" {
11:55:26.073 STDOUT terraform1.10.5:       + arn      = (known after apply)
11:55:26.073 STDOUT terraform1.10.5:       + id       = (known after apply)
11:55:26.073 STDOUT terraform1.10.5:       + name     = "t1-skeleton-eu-central-1-mycluster5-on-demand"
11:55:26.073 STDOUT terraform1.10.5:       + tags     = {
11:55:26.073 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.074 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.074 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.074 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.074 STDOUT terraform1.10.5:         }
11:55:26.074 STDOUT terraform1.10.5:       + tags_all = {
11:55:26.074 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.074 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.074 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.074 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.074 STDOUT terraform1.10.5:         }
11:55:26.074 STDOUT terraform1.10.5:       + auto_scaling_group_provider {
11:55:26.074 STDOUT terraform1.10.5:           + auto_scaling_group_arn         = (known after apply)
11:55:26.074 STDOUT terraform1.10.5:           + managed_draining               = (known after apply)
11:55:26.074 STDOUT terraform1.10.5:           + managed_termination_protection = "ENABLED"
11:55:26.075 STDOUT terraform1.10.5:           + managed_scaling {
11:55:26.075 STDOUT terraform1.10.5:               + instance_warmup_period    = (known after apply)
11:55:26.075 STDOUT terraform1.10.5:               + maximum_scaling_step_size = 5
11:55:26.075 STDOUT terraform1.10.5:               + minimum_scaling_step_size = 1
11:55:26.075 STDOUT terraform1.10.5:               + status                    = "ENABLED"
11:55:26.075 STDOUT terraform1.10.5:               + target_capacity           = 60
11:55:26.079 STDOUT terraform1.10.5:             }
11:55:26.079 STDOUT terraform1.10.5:         }
11:55:26.079 STDOUT terraform1.10.5:     }
11:55:26.079 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
11:55:26.079 STDOUT terraform1.10.5:   + resource "aws_ecs_cluster" "this" {
11:55:26.079 STDOUT terraform1.10.5:       + arn      = (known after apply)
11:55:26.079 STDOUT terraform1.10.5:       + id       = (known after apply)
11:55:26.079 STDOUT terraform1.10.5:       + name     = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.079 STDOUT terraform1.10.5:       + tags     = {
11:55:26.080 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.080 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.080 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.080 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.080 STDOUT terraform1.10.5:         }
11:55:26.080 STDOUT terraform1.10.5:       + tags_all = {
11:55:26.080 STDOUT terraform1.10.5:           + "Environment" = "t1"
11:55:26.080 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.080 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
11:55:26.080 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:55:26.080 STDOUT terraform1.10.5:         }
11:55:26.080 STDOUT terraform1.10.5:       + configuration {
11:55:26.080 STDOUT terraform1.10.5:           + execute_command_configuration {
11:55:26.080 STDOUT terraform1.10.5:               + logging = "DEFAULT"
11:55:26.080 STDOUT terraform1.10.5:             }
11:55:26.080 STDOUT terraform1.10.5:         }
11:55:26.080 STDOUT terraform1.10.5:       + setting {
11:55:26.080 STDOUT terraform1.10.5:           + name  = "containerInsights"
11:55:26.081 STDOUT terraform1.10.5:           + value = "enabled"
11:55:26.081 STDOUT terraform1.10.5:         }
11:55:26.081 STDOUT terraform1.10.5:     }
11:55:26.081 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
11:55:26.081 STDOUT terraform1.10.5:   + resource "aws_ecs_cluster_capacity_providers" "this" {
11:55:26.081 STDOUT terraform1.10.5:       + capacity_providers = [
11:55:26.081 STDOUT terraform1.10.5:           + "t1-skeleton-eu-central-1-mycluster5-on-demand",
11:55:26.081 STDOUT terraform1.10.5:         ]
11:55:26.081 STDOUT terraform1.10.5:       + cluster_name       = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.081 STDOUT terraform1.10.5:       + id                 = (known after apply)
11:55:26.081 STDOUT terraform1.10.5:       + default_capacity_provider_strategy {
11:55:26.081 STDOUT terraform1.10.5:           + base              = 20
11:55:26.081 STDOUT terraform1.10.5:           + capacity_provider = "t1-skeleton-eu-central-1-mycluster5-on-demand"
11:55:26.081 STDOUT terraform1.10.5:           + weight            = 60
11:55:26.081 STDOUT terraform1.10.5:         }
11:55:26.081 STDOUT terraform1.10.5:     }
11:55:26.081 STDOUT terraform1.10.5: Plan: 12 to add, 0 to change, 0 to destroy.
11:55:26.081 STDOUT terraform1.10.5: 
11:55:26.081 STDOUT terraform1.10.5: Changes to Outputs:
11:55:26.082 STDOUT terraform1.10.5:   + cluster_arn                            = (known after apply)
11:55:26.082 STDOUT terraform1.10.5:   + cluster_autoscaling_capacity_providers = {
11:55:26.082 STDOUT terraform1.10.5:       + on-demand = {
11:55:26.082 STDOUT terraform1.10.5:           + arn                         = (known after apply)
11:55:26.082 STDOUT terraform1.10.5:           + auto_scaling_group_provider = [
11:55:26.082 STDOUT terraform1.10.5:               + {
11:55:26.082 STDOUT terraform1.10.5:                   + auto_scaling_group_arn         = (known after apply)
11:55:26.082 STDOUT terraform1.10.5:                   + managed_draining               = (known after apply)
11:55:26.082 STDOUT terraform1.10.5:                   + managed_scaling                = [
11:55:26.082 STDOUT terraform1.10.5:                       + {
11:55:26.082 STDOUT terraform1.10.5:                           + instance_warmup_period    = (known after apply)
11:55:26.082 STDOUT terraform1.10.5:                           + maximum_scaling_step_size = 5
11:55:26.082 STDOUT terraform1.10.5:                           + minimum_scaling_step_size = 1
11:55:26.084 STDOUT terraform1.10.5:                           + status                    = "ENABLED"
11:55:26.084 STDOUT terraform1.10.5:                           + target_capacity           = 60
11:55:26.084 STDOUT terraform1.10.5:                         },
11:55:26.084 STDOUT terraform1.10.5:                     ]
11:55:26.084 STDOUT terraform1.10.5:                   + managed_termination_protection = "ENABLED"
11:55:26.084 STDOUT terraform1.10.5:                 },
11:55:26.084 STDOUT terraform1.10.5:             ]
11:55:26.084 STDOUT terraform1.10.5:           + id                          = (known after apply)
11:55:26.084 STDOUT terraform1.10.5:           + name                        = "t1-skeleton-eu-central-1-mycluster5-on-demand"
11:55:26.084 STDOUT terraform1.10.5:           + tags                        = {
11:55:26.085 STDOUT terraform1.10.5:               + Environment = "t1"
11:55:26.085 STDOUT terraform1.10.5:               + Name        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.085 STDOUT terraform1.10.5:               + Namespace   = "skeleton"
11:55:26.085 STDOUT terraform1.10.5:               + Region      = "eu-central-1"
11:55:26.085 STDOUT terraform1.10.5:             }
11:55:26.085 STDOUT terraform1.10.5:           + tags_all                    = {
11:55:26.085 STDOUT terraform1.10.5:               + Environment = "t1"
11:55:26.085 STDOUT terraform1.10.5:               + Name        = "t1-skeleton-eu-central-1-mycluster5"
11:55:26.085 STDOUT terraform1.10.5:               + Namespace   = "skeleton"
11:55:26.085 STDOUT terraform1.10.5:               + Region      = "eu-central-1"
11:55:26.085 STDOUT terraform1.10.5:             }
11:55:26.085 STDOUT terraform1.10.5:         }
11:55:26.085 STDOUT terraform1.10.5:     }
11:55:26.085 STDOUT terraform1.10.5:   + cluster_capacity_providers             = (known after apply)
11:55:26.085 STDOUT terraform1.10.5:   + cluster_id                             = (known after apply)
11:55:26.085 STDOUT terraform1.10.5:   + cluster_name                           = "t1-skeleton-eu-central-1-mycluster5"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5 -w devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://global-common-eu-central-1-atlantis.skeleton-dev.testenv.io/lock?id=cryptocat-org%252Fdevops-digger%252Fdevops-dev%252Ft1%252Feu-central-1%252Fskeleton%252Fecs_clusters%252Fmycluster5%252Fdevops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5 -w devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```